#4.
# Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки. Строки нужно пронумеровать.
# Если слово длинное, выводить только первые 10 букв в слове.

spisok = [1, 'gogi', [3,14], 'Pi', 'Hi', 24.02]
print(spisok)